{"data":{"allMdx":{"edges":[{"node":{"frontmatter":{"title":"CS 265 Is Now A Large Lecture","humanDate":"Jan 31st, 2021","datetime":"2021-01-31"},"fields":{"slug":"2021/01/31/cs-265-lecture"},"excerpt":"Another computer science core class has changed to the large lecture format. This semester, CSCI 265 Computer Theory I will be offered twice a week as a 200-student synchronous online lecture. In previous semesters, it was offered as multiple sections of about 30 students each. In fall 2020, the cl…","timeToRead":2}},{"node":{"frontmatter":{"title":"Github Responds to Request to Take Down 'youtube-dl' Library","humanDate":"Nov 16th, 2020","datetime":"2020-11-16"},"fields":{"slug":"2020/11/16/github-youtube-dl"},"excerpt":"Github  reinstated  on Monday the  youtube-dl  repository, a popular Python library used to download youtube videos and audio.  Github is a web platform that hosts code repositories. Github was purchased by Microsoft in 2018 for  $7.5 billion . Some of the code hosted on Github is free for anyone t…","timeToRead":4}},{"node":{"frontmatter":{"title":"Analysis: Was Industry City \"Amazon Headquarters 2.0\"?","humanDate":"Nov 1st, 2020","datetime":"2020-11-01"},"fields":{"slug":"2020/11/01/amazon-industry-city"},"excerpt":"Background The defeat of two big real-estate projects within a 20-month span leaves New Yorkers wondering how to create jobs without gentrifying the Big Apple. In September, a plan to rezone Brooklyn's industrial waterfront into retail, academic and commercial space fell through. Progressives put u…","timeToRead":8}},{"node":{"frontmatter":{"title":"7 Ways To Explain APIs to Supreme Court Justices","humanDate":"Oct 15th, 2020","datetime":"2020-10-15"},"fields":{"slug":"2020/10/15/oracle-google-analogies"},"excerpt":"Suppose you are a lawyer arguing a technical case to the Supreme Court. You are standing in an 85 year-old neo-classical building. The nine justices you are speaking to aren't much younger. Before the death of Justice Ruth Bader Ginsburg in September 2020, the average age on the court was  70  (it …","timeToRead":4}},{"node":{"frontmatter":{"title":"Docker Tutorial","humanDate":"Sep 25th, 2020","datetime":"2020-09-25"},"fields":{"slug":"2020/09/25/docker-tutorial"},"excerpt":"What is Docker? In short, Docker is a tool that converts a project into an image that can run in a container. It's a tool that developers can use to take code that they have already written and easily run it anywhere. It is especially useful for when you develop an application locally and want to d…","timeToRead":8}},{"node":{"frontmatter":{"title":"Meet Dr. Sarah Ita Levitan","humanDate":"Sep 23rd, 2020","datetime":"2020-09-23"},"fields":{"slug":"2020/09/23/dr-levitan"},"excerpt":"Dr. Sarah Ita Levitan is the newest member of Hunter College's Computer Science faculty. She joins us as an assistant professor. This fall, she is teaching the language technology elective (CSCI 49362). In Spring of 2021, she will be teaching the required computer theory course (CSCI 265). Dr. Levi…","timeToRead":2}},{"node":{"frontmatter":{"title":"Meet Dr. Tong Yi","humanDate":"Sep 23rd, 2020","datetime":"2020-09-23"},"fields":{"slug":"2020/09/23/dr-tong-yi"},"excerpt":"Dr. Tong Yi is the latest addition to the teaching community at Hunter College’s Computer Science department, and this semester, she is instructing CSCI 13500, otherwise known as  Software Design and Analysis I . In her most recent position at SUNY Old Westbury, she specifically instructed undergra…","timeToRead":2}},{"node":{"frontmatter":{"title":"How Not to Spend Your First Semester as a CS Student","humanDate":"Sep 1st, 2020","datetime":"2020-09-01"},"fields":{"slug":"2020/09/01/how-not-to-spend-freshman-year"},"excerpt":"As a service to the incoming freshman class, I’ve decided to provide a list of five things not to do during your first few semesters (which I’ve unearthed through many post-mortems of my own experiences). There are often greater insights to be found from self-proclaimed failures than from people wh…","timeToRead":3}},{"node":{"frontmatter":{"title":"New CS Professors at Hunter","humanDate":"Aug 31st, 2020","datetime":"2020-08-31"},"fields":{"slug":"2020/08/31/new-professors-fall-2020"},"excerpt":"Two new professors join the Computer Science department faculty this fall. For the students who would like to get to know them better,  The Icarus  will be publishing interviews with each of them this month. Dr. Sarah Ita Levitan  will be teaching the linguistics elective this fall and then CSCI 26…","timeToRead":1}},{"node":{"frontmatter":{"title":"Facebook Moves Into NYC","humanDate":"Aug 7th, 2020","datetime":"2020-08-07"},"fields":{"slug":"2020/08/07/facebook-moves-into-nyc"},"excerpt":"Facebook on August 3 agreed to lease all the office space in the mammoth 107-year-old James A. Farley Building in Midtown Manhattan, cementing New York City as a growing global technology hub and reaffirming a major corporation’s commitment to an office-centric urban culture despite the pandemic. W…","timeToRead":1}}]}}}